<?php

class Currency_Semantic_Ru extends Currency_Semantic {

   protected $_nums_1_2 = array(
      1 => 'одна ',
      2 => 'две ',
   );

   protected $_nums_1_19 = array (
      1 => 'один ',
      2 => 'два ',
      3 => 'три ',
      4 => 'четыре ',
      5 => 'пять ',
      6 => 'шесть ',
      7 => 'семь ',
      8 => 'восемь ',
      9 => 'девять ',
      10 => 'десять ',
      11 => 'одиннацать ',
      12 => 'двенадцать ',
      13 => 'тринадцать ',
      14 => 'четырнадцать ',
      15 => 'пятнадцать ',
      16 => 'шестнадцать ',
      17 => 'семнадцать ',
      18 => 'восемнадцать ',
      19 => 'девятнадцать ',
   );

   protected $_nums_ten_fold = array (
      2 => 'двадцать ',
      3 => 'тридцать ',
      4 => 'сорок ',
      5 => 'пятьдесят ',
      6 => 'шестьдесят ',
      7 => 'семьдесят ',
      8 => 'восемдесят ',
      9 => 'девяносто ',
   );

   protected $_nums_hundred_fold = array (
      1 => 'сто ',
      2 => 'двести ',
      3 => 'триста ',
      4 => 'четыреста ',
      5 => 'пятьсот ',
      6 => 'шестьсот ',
      7 => 'семьсот ',
      8 => 'восемьсот ',
      9 => 'девятьсот ',
   );

   protected $_names_thousand = array (
      1 => 'тысяча ',
      2 => 'тысячи ',
      3 => 'тысяч ',
   );

   protected $_names_million = array (
      1 => 'миллион ',
      2 => 'миллиона ',
      3 => 'миллионов ',
   );

   protected $_names_billion = array (
      1 => 'миллиард ',
      2 => 'миллиарда ',
      3 => 'миллиардов ',
   );

   protected $_currency_names = array (
      1 => 'доллар США',
      2 => 'доллара США',
      3 => 'долларов США',
   );

   protected $_cents = array (
      1 => 'цент ',
      2 => 'цента ',
      3 => 'центов ',
   );

}
