<?
$purposes=array(
			0=>'Прочее',
			'Стоимость авто на аукционе',
			'Аукционный сбор',
			'Постпродажная инспекция',
			'Доставка до порта',
			'Доставка контейнером',
			'Разгрузка',
			'Таможня',
			'Ремонт',
			' - покупка запчастей',
			' - рихтовка',
			' - покраска',
			' - замена масел',
			' - ходовка',
			' - двигатель',
			' - коробка передач',
			' - реставрация салона',
			' - днище',
			' - химчистка, полировка',
			'Комиссия продавца',
			30=>'Продажа контейнера'
		);
?>